###################################################################

# Created by write_sdc on Mon Jan 3 14:29:51 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_ideal_network [get_ports clk]
set_ideal_network [get_ports rstn]
create_clock [get_ports clk]  -name clock_main  -period 5  -waveform {0 2.5}
set_clock_latency 0.05  [get_clocks clock_main]
set_clock_uncertainty -setup 1.5  [get_clocks clock_main]
set_clock_uncertainty -hold 0.05  [get_clocks clock_main]
set_clock_transition -max -rise 0.05 [get_clocks clock_main]
set_clock_transition -max -fall 0.05 [get_clocks clock_main]
set_clock_transition -min -rise 0.05 [get_clocks clock_main]
set_clock_transition -min -fall 0.05 [get_clocks clock_main]
group_path -name FEEDTHROUGH  -from [list [get_ports rstn] [get_ports en] [get_ports {multiplier[31]}] [get_ports {multiplier[30]}] [get_ports {multiplier[29]}] [get_ports {multiplier[28]}] [get_ports {multiplier[27]}] [get_ports {multiplier[26]}] [get_ports {multiplier[25]}] [get_ports {multiplier[24]}] [get_ports {multiplier[23]}] [get_ports {multiplier[22]}] [get_ports {multiplier[21]}] [get_ports {multiplier[20]}] [get_ports {multiplier[19]}] [get_ports {multiplier[18]}] [get_ports {multiplier[17]}] [get_ports {multiplier[16]}] [get_ports {multiplier[15]}] [get_ports {multiplier[14]}] [get_ports {multiplier[13]}] [get_ports {multiplier[12]}] [get_ports {multiplier[11]}] [get_ports {multiplier[10]}] [get_ports {multiplier[9]}] [get_ports {multiplier[8]}] [get_ports {multiplier[7]}] [get_ports {multiplier[6]}] [get_ports {multiplier[5]}] [get_ports {multiplier[4]}] [get_ports {multiplier[3]}] [get_ports {multiplier[2]}] [get_ports {multiplier[1]}] [get_ports {multiplier[0]}] [get_ports {multiplicand[31]}] [get_ports {multiplicand[30]}] [get_ports {multiplicand[29]}] [get_ports {multiplicand[28]}] [get_ports {multiplicand[27]}] [get_ports {multiplicand[26]}] [get_ports {multiplicand[25]}] [get_ports {multiplicand[24]}] [get_ports {multiplicand[23]}] [get_ports {multiplicand[22]}] [get_ports {multiplicand[21]}] [get_ports {multiplicand[20]}] [get_ports {multiplicand[19]}] [get_ports {multiplicand[18]}] [get_ports {multiplicand[17]}] [get_ports {multiplicand[16]}] [get_ports {multiplicand[15]}] [get_ports {multiplicand[14]}] [get_ports {multiplicand[13]}] [get_ports {multiplicand[12]}] [get_ports {multiplicand[11]}] [get_ports {multiplicand[10]}] [get_ports {multiplicand[9]}] [get_ports {multiplicand[8]}] [get_ports {multiplicand[7]}] [get_ports {multiplicand[6]}] [get_ports {multiplicand[5]}] [get_ports {multiplicand[4]}] [get_ports {multiplicand[3]}] [get_ports {multiplicand[2]}] [get_ports {multiplicand[1]}] [get_ports {multiplicand[0]}]]  -to [list [get_ports done] [get_ports {product[63]}] [get_ports {product[62]}] [get_ports {product[61]}] [get_ports {product[60]}] [get_ports {product[59]}] [get_ports {product[58]}] [get_ports {product[57]}] [get_ports {product[56]}] [get_ports {product[55]}] [get_ports {product[54]}] [get_ports {product[53]}] [get_ports {product[52]}] [get_ports {product[51]}] [get_ports {product[50]}] [get_ports {product[49]}] [get_ports {product[48]}] [get_ports {product[47]}] [get_ports {product[46]}] [get_ports {product[45]}] [get_ports {product[44]}] [get_ports {product[43]}] [get_ports {product[42]}] [get_ports {product[41]}] [get_ports {product[40]}] [get_ports {product[39]}] [get_ports {product[38]}] [get_ports {product[37]}] [get_ports {product[36]}] [get_ports {product[35]}] [get_ports {product[34]}] [get_ports {product[33]}] [get_ports {product[32]}] [get_ports {product[31]}] [get_ports {product[30]}] [get_ports {product[29]}] [get_ports {product[28]}] [get_ports {product[27]}] [get_ports {product[26]}] [get_ports {product[25]}] [get_ports {product[24]}] [get_ports {product[23]}] [get_ports {product[22]}] [get_ports {product[21]}] [get_ports {product[20]}] [get_ports {product[19]}] [get_ports {product[18]}] [get_ports {product[17]}] [get_ports {product[16]}] [get_ports {product[15]}] [get_ports {product[14]}] [get_ports {product[13]}] [get_ports {product[12]}] [get_ports {product[11]}] [get_ports {product[10]}] [get_ports {product[9]}] [get_ports {product[8]}] [get_ports {product[7]}] [get_ports {product[6]}] [get_ports {product[5]}] [get_ports {product[4]}] [get_ports {product[3]}] [get_ports {product[2]}] [get_ports {product[1]}] [get_ports {product[0]}]]
group_path -name REGIN  -from [list [get_ports rstn] [get_ports en] [get_ports {multiplier[31]}] [get_ports {multiplier[30]}] [get_ports {multiplier[29]}] [get_ports {multiplier[28]}] [get_ports {multiplier[27]}] [get_ports {multiplier[26]}] [get_ports {multiplier[25]}] [get_ports {multiplier[24]}] [get_ports {multiplier[23]}] [get_ports {multiplier[22]}] [get_ports {multiplier[21]}] [get_ports {multiplier[20]}] [get_ports {multiplier[19]}] [get_ports {multiplier[18]}] [get_ports {multiplier[17]}] [get_ports {multiplier[16]}] [get_ports {multiplier[15]}] [get_ports {multiplier[14]}] [get_ports {multiplier[13]}] [get_ports {multiplier[12]}] [get_ports {multiplier[11]}] [get_ports {multiplier[10]}] [get_ports {multiplier[9]}] [get_ports {multiplier[8]}] [get_ports {multiplier[7]}] [get_ports {multiplier[6]}] [get_ports {multiplier[5]}] [get_ports {multiplier[4]}] [get_ports {multiplier[3]}] [get_ports {multiplier[2]}] [get_ports {multiplier[1]}] [get_ports {multiplier[0]}] [get_ports {multiplicand[31]}] [get_ports {multiplicand[30]}] [get_ports {multiplicand[29]}] [get_ports {multiplicand[28]}] [get_ports {multiplicand[27]}] [get_ports {multiplicand[26]}] [get_ports {multiplicand[25]}] [get_ports {multiplicand[24]}] [get_ports {multiplicand[23]}] [get_ports {multiplicand[22]}] [get_ports {multiplicand[21]}] [get_ports {multiplicand[20]}] [get_ports {multiplicand[19]}] [get_ports {multiplicand[18]}] [get_ports {multiplicand[17]}] [get_ports {multiplicand[16]}] [get_ports {multiplicand[15]}] [get_ports {multiplicand[14]}] [get_ports {multiplicand[13]}] [get_ports {multiplicand[12]}] [get_ports {multiplicand[11]}] [get_ports {multiplicand[10]}] [get_ports {multiplicand[9]}] [get_ports {multiplicand[8]}] [get_ports {multiplicand[7]}] [get_ports {multiplicand[6]}] [get_ports {multiplicand[5]}] [get_ports {multiplicand[4]}] [get_ports {multiplicand[3]}] [get_ports {multiplicand[2]}] [get_ports {multiplicand[1]}] [get_ports {multiplicand[0]}]]
group_path -name REGOUT  -to [list [get_ports done] [get_ports {product[63]}] [get_ports {product[62]}] [get_ports {product[61]}] [get_ports {product[60]}] [get_ports {product[59]}] [get_ports {product[58]}] [get_ports {product[57]}] [get_ports {product[56]}] [get_ports {product[55]}] [get_ports {product[54]}] [get_ports {product[53]}] [get_ports {product[52]}] [get_ports {product[51]}] [get_ports {product[50]}] [get_ports {product[49]}] [get_ports {product[48]}] [get_ports {product[47]}] [get_ports {product[46]}] [get_ports {product[45]}] [get_ports {product[44]}] [get_ports {product[43]}] [get_ports {product[42]}] [get_ports {product[41]}] [get_ports {product[40]}] [get_ports {product[39]}] [get_ports {product[38]}] [get_ports {product[37]}] [get_ports {product[36]}] [get_ports {product[35]}] [get_ports {product[34]}] [get_ports {product[33]}] [get_ports {product[32]}] [get_ports {product[31]}] [get_ports {product[30]}] [get_ports {product[29]}] [get_ports {product[28]}] [get_ports {product[27]}] [get_ports {product[26]}] [get_ports {product[25]}] [get_ports {product[24]}] [get_ports {product[23]}] [get_ports {product[22]}] [get_ports {product[21]}] [get_ports {product[20]}] [get_ports {product[19]}] [get_ports {product[18]}] [get_ports {product[17]}] [get_ports {product[16]}] [get_ports {product[15]}] [get_ports {product[14]}] [get_ports {product[13]}] [get_ports {product[12]}] [get_ports {product[11]}] [get_ports {product[10]}] [get_ports {product[9]}] [get_ports {product[8]}] [get_ports {product[7]}] [get_ports {product[6]}] [get_ports {product[5]}] [get_ports {product[4]}] [get_ports {product[3]}] [get_ports {product[2]}] [get_ports {product[1]}] [get_ports {product[0]}]]
set_input_delay -clock clock_main  -max 1  [get_ports rstn]
set_input_delay -clock clock_main  -min 0.1  [get_ports rstn]
set_input_delay -clock clock_main  -max 1  [get_ports en]
set_input_delay -clock clock_main  -min 0.1  [get_ports en]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[31]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[31]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[30]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[30]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[29]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[29]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[28]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[28]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[27]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[27]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[26]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[26]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[25]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[25]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[24]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[24]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[23]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[23]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[22]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[22]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[21]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[21]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[20]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[20]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[19]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[19]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[18]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[18]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[17]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[17]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[16]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[16]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[15]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[15]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[14]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[14]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[13]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[13]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[12]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[12]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[11]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[11]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[10]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[10]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[9]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[9]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[8]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[8]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[7]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[7]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[6]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[6]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[5]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[5]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[4]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[4]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[3]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[3]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[2]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[2]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[1]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[1]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplier[0]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplier[0]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[31]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[31]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[30]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[30]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[29]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[29]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[28]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[28]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[27]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[27]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[26]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[26]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[25]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[25]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[24]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[24]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[23]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[23]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[22]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[22]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[21]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[21]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[20]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[20]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[19]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[19]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[18]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[18]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[17]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[17]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[16]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[16]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[15]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[15]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[14]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[14]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[13]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[13]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[12]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[12]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[11]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[11]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[10]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[10]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[9]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[9]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[8]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[8]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[7]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[7]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[6]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[6]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[5]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[5]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[4]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[4]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[3]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[3]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[2]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[2]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[1]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[1]}]
set_input_delay -clock clock_main  -max 1  [get_ports {multiplicand[0]}]
set_input_delay -clock clock_main  -min 0.1  [get_ports {multiplicand[0]}]
set_output_delay -clock clock_main  -max 1  [get_ports done]
set_output_delay -clock clock_main  -min 0.1  [get_ports done]
set_output_delay -clock clock_main  -max 1  [get_ports {product[63]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[63]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[62]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[62]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[61]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[61]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[60]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[60]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[59]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[59]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[58]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[58]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[57]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[57]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[56]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[56]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[55]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[55]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[54]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[54]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[53]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[53]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[52]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[52]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[51]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[51]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[50]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[50]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[49]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[49]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[48]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[48]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[47]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[47]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[46]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[46]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[45]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[45]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[44]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[44]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[43]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[43]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[42]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[42]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[41]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[41]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[40]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[40]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[39]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[39]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[38]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[38]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[37]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[37]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[36]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[36]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[35]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[35]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[34]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[34]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[33]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[33]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[32]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[32]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[31]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[31]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[30]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[30]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[29]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[29]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[28]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[28]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[27]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[27]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[26]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[26]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[25]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[25]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[24]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[24]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[23]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[23]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[22]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[22]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[21]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[21]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[20]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[20]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[19]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[19]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[18]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[18]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[17]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[17]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[16]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[16]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[15]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[15]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[14]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[14]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[13]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[13]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[12]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[12]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[11]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[11]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[10]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[10]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[9]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[9]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[8]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[8]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[7]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[7]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[6]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[6]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[5]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[5]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[4]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[4]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[3]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[3]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[2]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[2]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[1]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[1]}]
set_output_delay -clock clock_main  -max 1  [get_ports {product[0]}]
set_output_delay -clock clock_main  -min 0.1  [get_ports {product[0]}]
